// 例3.6-过河卒问题（NOIP2002）.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <iostream>
using namespace std;

long long B[21][21];
int n, m, a, b;

void init()
{
	for (int i = 0; i <= n; i++) { //先把所有点都赋为1，刚刚讲的特殊情况下面再考虑 
		for (int j = 0; j <= m; j++) {
			B[i][j] = 1;
		}
	}
	if (a - 2 >= 0 && b - 1 >= 0)  //把马的位置和所有马能走到的位置都赋为0，注意考虑边界 
		B[a - 2][b - 1] = 0;
	if (a - 2 >= 0 && b + 1 <= m)
		B[a - 2][b + 1] = 0;
	if (a - 1 >= 0 && b - 2 >= 0)
		B[a - 1][b - 2] = 0;
	if (a - 1 >= 0 && b + 2 <= m)
		B[a - 1][b + 2] = 0;
	if (a + 1 <= m && b - 2 >= 0)
		B[a + 1][b - 2] = 0;
	if (a + 2 <= n && b - 1 >= 0)
		B[a + 2][b - 1] = 0;
	if (a + 1 <= n && b + 2 <= m)
		B[a + 1][b + 2] = 0;
	if (a + 1 <= n && b + 1 <= m)
		B[a + 2][b + 1] = 0;
	B[a][b] = 0;
}

int main()
{
	cin >> n >> m >> a >> b;
	init();
	for (int i = 0; i <= n; i++) {
		for (int j = 0; j <= m; j++) {
			if (B[i][j] != 0) {
				if (i == 0 && j == 0) {
					continue;
				}/*这里就是处理所说的特殊情况，相当于如果在最上一行或者最左一行
				   出现一个马，那么后面的值都赋为0
				*/
				else if (i == 0) {
					B[i][j] = B[i][j - 1];
				}
				else if (j == 0) {
					B[i][j] = B[i - 1][j];
				}
				else {
					B[i][j] = B[i - 1][j] + B[i][j - 1];
				}
			}
		}
	}
	cout << B[n][m] << endl;
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
