// 例5.5-马的遍历.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <iostream>
using namespace std;

int a[100][3], t = 0;
int x[4] = { 2,1,-1,-2 };
int y[4] = { 1,2,2,1 };

void search(int);
void print(int);

int main()
{
	a[1][1] = 0;
	a[1][2] = 0;
	search(2);
}

void search(int i) {
	for (int j = 0; j <= 3; j++)
	{
		if (a[i-1][1]+x[j] >= 0 && a[i-1][1]+x[j] <= 4 && a[i-1][2]+y[j] >= 0 && a[i-1][2]+y[j] <= 8)
		{
			a[i][1] = a[i - 1][1] + x[j];
			a[i][2] = a[i - 1][2] + y[j];
			if (a[i][1] == 4 && a[i][2] == 8)
			{
				print(i);
			}
			else
			{
				search(i + 1);
			}
		}
	}
}

void print(int k) {
	t++;
	cout << t << ": ";
	for (int i = 1; i <= k - 1; i++) {
		cout << a[i][1] << "," << a[i][2] << "-->";
	}
	cout << "4,8" << endl;
}
// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
