// 例8.2-细胞个数.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <iostream>
using namespace std;
int dx[4] = { -1,0,1,0 };
int dy[4] = { 0,1,0,-1 };
int bz[4][10] = { 
{0,1,1,1,1,0,0,0,1,1},
{1,0,1,1,1,1,0,1,0,0},
{1,0,1,1,1,0,0,1,1,1},
{0,0,0,0,0,0,0,0,1,1} };
int num = 0;
void dfs(int,int);
int main()
{
	for (int i = 0; i < 4; i++)
	{
		for (int j = 0; j < 10; j++)
		{
			if (bz[i][j])
			{
				dfs(i, j);
			}
		}
	}
	cout << num << endl;
}
void dfs(int p, int q) {
	int x, y, t, w, i;
	int h[100][3];
	num++;
	bz[p][q] = 0;
	t = 0;
	w = 1;
	h[1][1] = p;
	h[1][2] = q;
	do
	{
		t++;
		for (i = 0; i <= 3; i++) {
			x = h[t][1] + dx[i];
			y = h[t][2] + dy[i];
			if ((x>=0) && (x<4) && (y>=0) && (y<10) && (bz[x][y]))
			{
				w++;
				h[w][1] = x;
				h[w][2] = y;
				h[x][y] = 0;
			}
		}
	} while (t<w);
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
