// 例8.1-城市路线.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <iostream>
using namespace std;
int ju[9][9] = { 
{0,0,0,0,0,0,0,0,0},
{0,1,0,0,0,1,0,1,1},
{0,0,1,1,1,1,0,1,1},
{0,0,1,1,0,0,1,1,1},
{0,0,1,0,1,1,1,0,1},
{0,1,1,0,1,1,1,0,0},
{0,0,0,1,1,1,1,1,0},
{0,1,1,1,0,0,1,1,0},
{0,1,1,1,1,0,0,0,1} };
int a[101], b[101];
bool s[9];
void out(int);
void doit();
int main()
{
    memset(s, false, sizeof(s));
    doit();
    return 0;
}
void out(int d) {
    cout << char(a[d] + 64);
    while (b[d])
    {
        d = b[d];
        cout << "--" << char(a[d] + 64);
    }
    cout << endl;
}
void doit() {
    int head, tail, i;
    head = 0;
    tail = 1;
    a[1] = 1;
    b[1] = 0;
    s[1] = 1;
    do
    {
        head++;
        for (i = 1; i <= 8; i++) {
            if ((ju[a[head]][i] == 0) && (s[i] == 0))
            {
                tail++;
                a[tail] = i;
                b[tail] = head;
                s[i] = 1;
                if (i==8)
                {
                    out(tail);
                    head = tail;
                    break;
                }
            }
        }
    } while (head<tail);
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
